<html>
<head>
<title>Chat</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="../Css/Main.css" type="text/css">
<link rel="stylesheet" href="../Css/EvalResult.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<table width="100%" border="0" cellspacing="0" cellpadding="2">
  <tr> 
    <td class="ToolBar"> 
      <table border="0" cellspacing="0" cellpadding="0" class="ToolBar" width="100%">
        <tr> 
          <td width="1%"><img src="../Images/HelpIMG.gif" width="80" height="54"></td>
          <td class="HeaderTable" width="99%">
            <table border="0" cellspacing="0" cellpadding="0" class="ToolBar" width="100%">
             <tr> 
               <td  align=right><h6>Sistema de Enseñanza Personalizada a Distancia</h6></td>
            </tr>
             <tr> 
                <td class="HeaderTable" align=center colspan=2><b >Salas de chat</b></td>

            </tr>
            </table>
          </td>
        </tr>
      </table>
    </td>
  </tr>
</table>
<table width="100%" border="0" cellspacing="0" cellpadding="2">
  <tr> 
    <td><b class="SubTitle">Salas de chat</b> </td>
  </tr>
  <tr> 
    <td> 
      <table width="95%" border="0" cellspacing="2" cellpadding="2" align="center">
        <tr> 
          <td> <p>Las salas de discusi&oacute;n en l&iacute;nea o m&aacute;s com&uacute;nmente 
              llamadas salas de Chat son un medio de comunicaci&oacute;n que permite 
              el intercambio casi en tiempo real entre los usuarios que est&eacute;n 
              conectados a una de ellas. Estos sistemas generalmente cuentan con 
              un conjunto de salas las cuales tienen un sentido espec&iacute;fico 
              que determina la funcionalidad o el tema que se debate en ella aunque 
              este tema puede variar o ser tan general que permita el debate de 
              muchos temas a la vez. Un usuario puede enviar mensajes p&uacute;blicos 
              a la sala de forma que toda persona conectada a esta recibir&aacute; 
              dicho mensaje o puede tambi&eacute;n enviarlo a una persona espec&iacute;fica 
              para que solo esta tenga acceso a ver la informaci&oacute;n enviada. 
            </p>
            <p>Nuestro sistema cuenta con un conjunto de salas de Chat que permiten 
              mantener las relaciones interpersonales alumno-alumno y alumno-profesor 
              para no hacer del proceso de ense&ntilde;anza-aprendizaje un mecanismo 
              unidireccional sino un proceso donde la informaci&oacute;n fluya 
              en ambos sentidos permitiendo hacer valoraciones din&aacute;micas, 
              es decir que se generen a partir de la informaci&oacute;n que se 
              intercambie y que esta sirva como retroalimentaci&oacute;n para 
              la toma de decisiones. </p>
            <p>Para acceder a este servicio que brinda nuestra plataforma podemos 
              seleccionar la opci&oacute;n que se muestra en el men&uacute; con 
              el nombre de Chat y de esta forma nos llevar&aacute; a una secci&oacute;n 
              donde podremos escoger la sala a la que deseamos entrar.<br>
            </p>
            <p><img src="../usuarioImages/barrachat.jpg" width="432" height="15"></p>
            <p>La selecci&oacute;n de la sala a la que vamos a entrar se hace 
              presionando clic sobre el nombre de la sala que se muestra en la 
              lista de la cual tenemos adem&aacute;s del nombre su objetivo, cantidad 
              de usuarios conectados y su estado.</p>
            <p><img src="../usuarioImages/listasalachat.jpg" width="580" height="183"></p>
            <ul>
              <li><strong>Estructura:</strong><br><br><img src="../usuarioImages/salasdechat.jpg" width="577" height="340"><br><br>
                La interfaz con la cual interactúa el usuario en nuestra plataforma 
                esta dividida en 5 partes:<br>
                <ul>
                  <li><strong>Mensajes públicos:</strong><br>
                    En esta sección el usuario podrá ver todos los mensajes que 
                    se envían a la sala que tienen un carácter público ante todas 
                    las personas conectadas, lo cual significa que todos podrán 
                    ver la información que se envía a la sala. Además se puede 
                    ver la hora a la que fue enviado el mensaje así como el usuario 
                    que lo envió. El nombre del usuario que lo envía es hipervínculo 
                    a una sección de envío de mensajes privados. Se puede apreciar 
                    también las expresiones que los usuarios envían adjunta a 
                    sus mensajes como símbolos del estado de ánimo que tenían 
                    al enviarlo.<br>
                    <br><img src="../usuarioImages/mensajespublicos.jpg" width="393" height="147"><br><br>
                  </li>
                  <li><strong>Mensajes privados:</strong> <br>
                    En esta sección hemos querido hacer una distinción con los 
                    demás Chat conocidos y hemos separado la visión de los mensajes 
                    públicos de los privados. De esta forma el usuario que solo 
                    desee conversar en una sala con una determinada persona solo 
                    debe mirar a esta sección y no tiene que estar revisando grandes 
                    listas de mensajes para encontrar cual pertenece a dicha persona 
                    con la que desea conversar. Esta sección tiene las mismas 
                    características que la sección e mensajes públicos. <br>
                    <br><img src="../usuarioImages/mensajesprivados.jpg" width="394" height="139"><br><br>
                  </li>
                  <li><strong>Usuarios en l&iacute;nea</strong>:<br>
                    Esta secci&oacute;n permite tener una visi&oacute;n de cuales 
                    son los usuarios conectados al sistema pues se puede apreciar 
                    una lista de los nick(nombre usado para la identificaci&oacute;n 
                    en sistemas personalizados) los cuales constituyen enlaces 
                    o hiperv&iacute;nculos a una secci&oacute;n especial que permite 
                    el envi&oacute; de mensajes de car&aacute;cter privado. Cuando 
                    un usuario se conecta pasa a formar parte de la lista de personas 
                    en l&iacute;nea y cuando se desconecta es retirado de esta 
                    lista. Adem&aacute;s se podr&aacute; conocer el sexo de la 
                    persona conectada a trav&eacute;s de la imagen diferenciada 
                    que aparece por usuario.<br>
                    <br><img src="../usuarioImages/sala1.jpg" width="172" height="168"><br><br>
                  </li>
                  <li><strong>Env&iacute;o de mensajes p&uacute;blicos</strong>:<br>
                    En esta secci&oacute;n el usuario tiene una barra de edici&oacute;n 
                    que permite editar los mensajes que se desean enviar y adicionalmente 
                    posee unos controles que sirven para especificar el estilo 
                    en que se desea enviar el mensaje. El estilo incluye si la 
                    letra se enviar&aacute; en negrita, cursiva o subrayada lo 
                    cual se puede especificar marcando la forma deseada en los 
                    cuadros para marcado que se encuentran en la parte superior 
                    de la secci&oacute;n, adem&aacute;s se puede especificar un 
                    color haciendo click sobre la barra de colores que se encuentra 
                    a la derecha, el color seleccionado se puede ver al final 
                    de esta barra. Opcionalmente el usuario puede enviar una expresi&oacute;n 
                    que se especifica escogiendo una de las caritas que aparece 
                    al final de la secci&oacute;n y donde la expresi&oacute;n 
                    seleccionada se muestra en el cuadro que sigue a la flecha 
                    de color blanco. El bot&oacute;n <strong>Actualizar</strong> 
                    se puede usar para forzar a refrescar las listas de mensajes 
                    antes del tiempo especificado por el sistema.<br>
                    <br><img src="../usuarioImages/enviopublico.jpg" width="578" height="94"><br><br>
                  </li>
                  <li><strong>Env&iacute;o de mensajes privados</strong>:<br>
                    Esta secci&oacute;n tiene las mismas caracter&iacute;stica 
                    que la secci&oacute;n de env&iacute;o de mensajes p&uacute;blicos 
                    pero posee un componente m&aacute;s y es la lista de las personas 
                    que est&aacute;n conectadas para que el usuario seleccione 
                    a que personas desea enviarle el mensaje y de esta forma solo 
                    llegue a los escogidos. Otra caracter&iacute;stica especial 
                    que tiene esta secci&oacute;n es que se muestra en una ventana 
                    aparte para no interferir en el proceso normal.<br>
                    <br><img src="../usuarioImages/envioprivado.jpg" width="574" height="106">
                  </li>
                </ul>
              </li>
            </ul>
			</td>
        </tr>
      </table>
    </td>
  </tr>
</table>
</body>
</html>
