<html>
<head>
<title>Untitled Document</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="../../Css/MainPOage" type="text/css">
<link rel="stylesheet" href="../../Css/Main.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<table border="0" cellspacing="10" cellpadding="0" align="center">
  <tr> 
    <td align="center"><img src="../usuarioImages/Books.gif" width="80" height="54"> 
    </td>
    <td align="left" class="P0Header"> Sistema de Enseñanza <br>
      Personalizada a Distancia </td>
  </tr>
</table>
<table width="104%" border="0" cellspacing="10" cellpadding="10">
  <tr> 
    <td width="89%" height="305"> <p align="justify"> <b>&nbsp;&nbsp;&nbsp;&nbsp;SEPAD</b>, 
        nombrado as&iacute; por sus siglas, busca promover v&iacute;as alternativas 
        a las ya existentes en el campo de la ense&ntilde;anza asistida por computadoras. 
        Para ello toma como punto de partida el nuevo estilo de aplicaciones sobre 
        WEB para crear un cliente con todas las capacidades multimedias cl&aacute;sicas 
        de imagen, sonido y v&iacute;deo. A esto se a&ntilde;ade un procesamiento 
        centralizado que permite llevar el control individual de los objetivos 
        vencidos permitiendo conocer en cada momento el estado en que se encuentran 
        cada uno de los usuarios del sistema y el nivel de respuesta ante los 
        temas de cada asignatura. </p>
      <div align="justify">
        <p>Este sistema se encuentra organizado por modalidades académicas que 
          pueden ser diplomados, defierentes cursos, postgrados, etc. Los usuarios 
          del sistema han de matricular en una o varias modalidades según sus 
          intereses. Estas modalidades agrupan a los módulos o asignaturas. Un 
          usuario matriculado en una modalidad tiene acceso a todos los módulos 
          de esa modalidad. Un m&oacute;dulo est&aacute; compuesto por varias 
          lecciones que tienen un orden determinado, aunque el usuario tambi&eacute;n 
          puede acceder a las lecciones seg&uacute;n estime conveniente. Las lecciones 
          a su vez est&aacute;n compuestas por materiales y autoevaluaciones que 
          son calificadas por el sistema mostrando los resultados de forma inmediata 
          o son enviadas al profesor para revizarlas.</p>
        <p>Cada modalidad tendr&aacute; asociado un coordinador que es el m&aacute;ximo 
          exponente de la modalidad, o sea, el encargado de su direcci&oacute;n 
          y organizaci&oacute;n. Por cada m&oacute;dulo hay un profesor principal, 
          este tendr&aacute; la responsabilidad de atender al grupo de usuarios 
          que est&eacute;n recibiendo su m&oacute;dulo junto a los tutores. Cada 
          tutor es el encargado de asesorar a un subgrupo peque&ntilde;o dentro 
          del grupo. Por lo que cada m&oacute;dulo tiene varios tutores pero solo 
          un profesor principal.</p>
        <p>Las modalidades acad&eacute;micas, los m&oacute;dulos y las lecciones 
          tienen varios estados. Se muestran en la tabla que sigue a continuaci&oacute;n.</p>
        <table width="95%" border="1">
          <tr> 
            <td width="40%">&nbsp;</td>
            <td width="21%"><div align="center"><strong>Modalidad</strong></div></td>
            <td width="20%"><div align="center"><strong>M&oacute;dulo</strong></div></td>
            <td width="19%"><div align="center"><strong>Lecci&oacute;n</strong></div></td>
          </tr>
          <tr> 
            <td><strong>No visible</strong></td>
            <td> <div align="center">SI</div></td>
            <td><div align="center">SI</div></td>
            <td><div align="center">SI</div></td>
          </tr>
          <tr> 
            <td><strong>Deshabilitado</strong></td>
            <td><div align="center">SI</div></td>
            <td><div align="center">SI</div></td>
            <td><div align="center">SI</div></td>
          </tr>
          <tr> 
            <td><strong>En inscripci&oacute;n</strong></td>
            <td><div align="center">SI</div></td>
            <td><div align="center">NO</div></td>
            <td><div align="center">NO</div></td>
          </tr>
          <tr> 
            <td><strong>En curso</strong></td>
            <td><div align="center">SI</div></td>
            <td><div align="center">SI</div></td>
            <td><div align="center">SI</div></td>
          </tr>
          <tr> 
            <td><strong>En inscripci&oacute;n-en curso</strong></td>
            <td><div align="center">SI</div></td>
            <td><div align="center">NO</div></td>
            <td><div align="center">NO</div></td>
          </tr>
          <tr> 
            <td><strong>Finalizado</strong></td>
            <td><div align="center">SI</div></td>
            <td><div align="center">SI</div></td>
            <td><div align="center">SI</div></td>
          </tr>
        </table>
        <p></p>
      </div>
      </td>
  </tr>
</table>
</body>
</html>
